# Tipos de Variables que componen un data frame (9/29)

In [1]:
import pandas as pd 
import numpy as np

In [2]:
df_meteorites = pd.read_csv('./pandas/meteorite-landings.csv')
df_meteorites

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.983330, -115.683330)"

In [3]:
df_meteorites.head() # Muestra los primeros 5 datos

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"

In [4]:
df_meteorites.head(15) # Si quiero ver n numeros de datos hay que colocarlo dentro del parentesis en este caso los primeros 15

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919.0,32.10000,71.80000,"(32.100000, 71.800000)"
6,Adzhi-Bogdo (stone),390,Valid,LL3-6,910.0,Fell,1949.0,44.83333,95.16667,"(44.833330, 95.166670)"
7,Agen,392,Valid,H5,30000.0,Fell,1814.0,44.21667,0.61667,"(44.216670, 0.616670)"
8,Aguada,398,Valid,L6,1620.0,Fell,1930.0,-31.60000,-65.23333,"(-31.600000, -65.233330)"
9,Aguila Blanca,417,Valid,L,1440.0,Fell,1920.0,-30.86667,-64.55000,"(-30.866670, -64.550000)"
10,Aioun el Atrouss,423,Valid,Diogenite-pm,1000.0,Fell,1974.0,16.39806,-9.57028,"(16.398060, -9.570280)"
11,Aïr,424,Valid,L6,24000.0,Fell,1925.0,19.08333,8.38333,"(19.083330, 8.383330)"
12,Aire-sur-la-Lys,425,Valid,Unknown,NaN,Fell,1769.0,50.66667,2.33333,"(50.666670, 2.333330)"
13,Akaba,426,Valid,L6,779.0,Fell,1949.0,29.51667,35.05000,"(29.516670, 35.050000)"
14,Akbarpur,427,Valid,H4,1800.0,Fell,1838.0,29.71667,77.95000,"(29.716670, 77.950000)"

In [5]:
df_meteorites.tail() # Muestra los ultimos 5 datos

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.983330, -115.683330)"

In [6]:
df_meteorites.tail(15) # Si quiero ver n numeros de datos hay que colocarlo dentro del parentesis en este caso los ultimos 15

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
45701,Zegdou,30398,Valid,H3,6700.0,Found,1998.0,29.75000,-4.50000,"(29.750000, -4.500000)"
45702,Zelfana,31353,Valid,L5,1058.0,Found,2002.0,32.15833,4.63333,"(32.158330, 4.633330)"
45703,Zenda,30400,Valid,"Iron, IAB complex",3700.0,Found,1955.0,42.51333,-88.48944,"(42.513330, -88.489440)"
45704,Zerga,30402,Valid,LL6,76.0,Found,1973.0,20.25000,-12.68333,"(20.250000, -12.683330)"
45705,Zerhamra,30403,Valid,"Iron, IIIAB-an",630000.0,Found,1967.0,29.85861,-2.64500,"(29.858610, -2.645000)"
45706,Zerkaly,31354,Valid,H5,16000.0,Found,1956.0,52.13333,81.96667,"(52.133330, 81.966670)"
45707,Zhaoping,54609,Valid,"Iron, IAB complex",2000000.0,Found,1983.0,24.23333,111.18333,"(24.233330, 111.183330)"
45708,Zhigansk,30405,Valid,"Iron, IIIAB",900000.0,Found,1966.0,68.00000,128.30000,"(68.000000, 128.300000)"
45709,Zhongxiang,30406,Valid,Iron,100000.0,Found,1981.0,31.20000,112.50000,"(31.200000, 112.500000)"
45710,Zillah 001,31355,Valid,L6,1475.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.983330, -115.683330)"

In [7]:
df_meteorites.sample() # Toma un dato aleatorio

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
25413,Miller Range 090339,53450,Valid,L5,6.5,Found,2009.0,0.0,0.0,"(0.000000, 0.000000)"

In [8]:
df_meteorites.sample(10) # Toma datos aleatorios segun el numero que se coloca dentro del parentesis en este caso 10

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
12934,Graves Nunataks 98130,11121,Valid,L4,45.10,Found,1998.0,-86.71667,-141.50000,"(-86.716670, -141.500000)"
37817,Tanezrouft 019,23820,Valid,H5,32.00,Found,1991.0,24.74611,0.19889,"(24.746110, 0.198890)"
31822,Pecora Escarpment 91342,18633,Valid,H5,13.00,Found,1991.0,-85.67691,-69.06912,"(-85.676910, -69.069120)"
7833,Dhofar 473,7234,Valid,L6,145.00,Found,2001.0,19.17597,54.76417,"(19.175970, 54.764170)"
44438,Yamato 982135,38757,Valid,H4,4.01,Found,1998.0,0.00000,0.00000,"(0.000000, 0.000000)"
40799,Yamato 791610,26959,Valid,H5,22.61,Found,1979.0,-71.50000,35.66667,"(-71.500000, 35.666670)"
40665,Yamato 791468,26817,Valid,H5,11.29,Found,1979.0,-71.50000,35.66667,"(-71.500000, 35.666670)"
18826,LaPaz Icefield 04698,45246,Valid,L5,5.40,Found,2004.0,NaN,NaN,NaN
27343,Northwest Africa 2282,30941,Valid,L6,155.00,Found,2003.0,NaN,NaN,NaN
31722,Pecora Escarpment 91242,18533,Valid,H5,21.90,Found,1991.0,-85.57651,-68.52910,"(-85.576510, -68.529100)"

In [9]:
df_meteorites.shape # Devueleve el numero de fila y columnas respectivamente

(45716, 10)

In [10]:
df_meteorites.size # Devuelve la cantida de los datos totales que hay en la base

457160

In [11]:
df_meteorites.describe() # estadistica de los datos

                 id          mass          year        reclat       reclong
count  45716.000000  4.558500e+04  45428.000000  38401.000000  38401.000000
mean   26889.735104  1.327808e+04   1991.772189    -39.122580     61.074319
std    16860.683030  5.749889e+05     27.181247     46.378511     80.647298
min        1.000000  0.000000e+00    301.000000    -87.366670   -165.433330
25%    12688.750000  7.200000e+00   1987.000000    -76.714240      0.000000
50%    24261.500000  3.260000e+01   1998.000000    -71.500000     35.666670
75%    40656.750000  2.026000e+02   2003.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2501.000000     81.166670    354.473330

In [12]:
pd.options.display.float_format='{:.1f}'.format # Este quita las notaciones cientificas y lo que esta entre {} es donde se colocan los decimales deseables

In [13]:
df_meteorites.describe(include='all') # Esto es para tener informacion de las variables tipo texto

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
count,45716,45716.0,45716,45716,45585.0,45716,45428.0,38401.0,38401.0,38401
unique,45716,NaN,2,466,NaN,2,NaN,NaN,NaN,17100
top,Coyote Dry Lake 002,NaN,Valid,L6,NaN,Found,NaN,NaN,NaN,"(0.000000, 0.000000)"
freq,1,NaN,45641,8285,NaN,44609,NaN,NaN,NaN,6214
mean,NaN,26889.7,NaN,NaN,13278.1,NaN,1991.8,-39.1,61.1,NaN
std,NaN,16860.7,NaN,NaN,574988.9,NaN,27.2,46.4,80.6,NaN
min,NaN,1.0,NaN,NaN,0.0,NaN,301.0,-87.4,-165.4,NaN
25%,NaN,12688.8,NaN,NaN,7.2,NaN,1987.0,-76.7,0.0,NaN
50%,NaN,24261.5,NaN,NaN,32.6,NaN,1998.0,-71.5,35.7,NaN
75%,NaN,40656.8,NaN,NaN,202.6,NaN,2003.0,0.0,157.2,NaN
max,NaN,57458.0,NaN,NaN,60000000.0,NaN,2501.0,81.2,354.5,NaN

In [14]:
df_meteorites.info() # Es para ver de que estan compuesta nuestra informacion

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [15]:
df_meteorites.dtypes # Tipo de las variables

name            object
id               int64
nametype        object
recclass        object
mass           float64
fall            object
year           float64
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [16]:
df_meteorites.convert_dtypes().dtypes # Encontrar y convertir el formato mas indicado

name            string
id               Int64
nametype        string
recclass        string
mass           Float64
fall            string
year             Int64
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

# Estructuras de dataframes en detalle (10/29)

In [17]:
df_meteorites.nunique() # Para saber la variedad de los datos que conforma el dataframes

name           45716
id             45716
nametype           2
recclass         466
mass           12576
fall               2
year             268
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [18]:
df_meteorites[['fall','nametype']] # verificar que tiene

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]

In [19]:
df_meteorites[['fall','nametype']].astype('category') # Nombrar una nueva categoria en el dataframe

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]

In [20]:
df_meteorites[['fall','nametype']] = df_meteorites[['fall','nametype']].astype('category') # Hcer cambio en el tipo de variables

In [21]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass            float64
fall           category
year            float64
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [22]:
df_meteorites['fall'].unique() # Para saber cuales son las variables que componen la categorias

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [23]:
df_meteorites['fall'].value_counts() # Muestra cuantas veces aparece la variable de cateforias en todo el dataframe

Found    44609
Fell      1107
Name: fall, dtype: int64

In [24]:
pd.get_dummies(df_meteorites['fall']) # Crea un nuevo dataframes mostrando que cuando esta la palabra es 1 y cuando no es 0, donde nuestro formato texto pasa a formato numerico

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [25]:
df_meteorites['ones']=1 # Crea una nueva columnas con el numero 1 en todos los datos 
df_meteorites

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,ones
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.8,6.1,"(50.775000, 6.083330)",1
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.2,-113.0,"(54.216670, -113.000000)",1
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.2,-65.0,"(-33.166670, -64.950000)",1
...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",1
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",1
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",1

In [26]:
df_meteorites[['fell','found']] = pd.get_dummies(df_meteorites['fall']) # Crea 2 nuevas columnas con datos numericos
df_meteorites

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,ones,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.8,6.1,"(50.775000, 6.083330)",1,1,0
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,1,0
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.2,-113.0,"(54.216670, -113.000000)",1,1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,1,0
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.2,-65.0,"(-33.166670, -64.950000)",1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",1,0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",1,0,1
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",1,0,1
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",1,0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",1,0,1

In [27]:
df_meteorites['year']

0       1880.0
1       1951.0
2       1952.0
3       1976.0
4       1902.0
         ...
45711   1990.0
45712   1999.0
45713   1939.0
45714   2003.0
45715   1976.0
Name: year, Length: 45716, dtype: float64

In [28]:
pd.to_datetime(
    df_meteorites['year'],
    errors = 'coerce',
    format ='%m/%d/%Y %H:%M:%S %p'
)

0       NaT
1       NaT
2       NaT
3       NaT
4       NaT
         ..
45711   NaT
45712   NaT
45713   NaT
45714   NaT
45715   NaT
Name: year, Length: 45716, dtype: datetime64[ns]

In [29]:
df_meteorites.rename(columns={'mass (g)': 'mass'}, inplace= True) # Renombrando una columna y inplace quiere decir que quedaran guardado inplace directamente

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,ones,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.8,6.1,"(50.775000, 6.083330)",1,1,0
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,1,0
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.2,-113.0,"(54.216670, -113.000000)",1,1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,1,0
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.2,-65.0,"(-33.166670, -64.950000)",1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",1,0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",1,0,1
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",1,0,1
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",1,0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",1,0,1

# Borrar filas, columnas y copiar información (11/29)

In [38]:
df_meteorites.drop(['ones'], axis=1, inplace=True) # Elimiando columna y el axis quiere decir que es el dato de la columna

KeyError: "['ones'] not found in axis"

In [40]:
df_meteorites.drop([0,2,4,6]).head(10) # Eliminando datos 0,2,4 y 6, estos datos se borran del eje numerico

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,0
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919.0,32.1,71.8,"(32.100000, 71.800000)",1,0
7,Agen,392,Valid,H5,30000.0,Fell,1814.0,44.2,0.6,"(44.216670, 0.616670)",1,0
8,Aguada,398,Valid,L6,1620.0,Fell,1930.0,-31.6,-65.2,"(-31.600000, -65.233330)",1,0
9,Aguila Blanca,417,Valid,L,1440.0,Fell,1920.0,-30.9,-64.5,"(-30.866670, -64.550000)",1,0
10,Aioun el Atrouss,423,Valid,Diogenite-pm,1000.0,Fell,1974.0,16.4,-9.6,"(16.398060, -9.570280)",1,0
11,Aïr,424,Valid,L6,24000.0,Fell,1925.0,19.1,8.4,"(19.083330, 8.383330)",1,0
12,Aire-sur-la-Lys,425,Valid,Unknown,NaN,Fell,1769.0,50.7,2.3,"(50.666670, 2.333330)",1,0
13,Akaba,426,Valid,L6,779.0,Fell,1949.0,29.5,35.0,"(29.516670, 35.050000)",1,0

In [41]:
df_meteorites.drop(columns=['id','recclass'], index=[0,2,4,6]) # Eliminando columnas y index

,name,nametype,mass,fall,year,reclat,reclong,GeoLocation,fell,found
1,Aarhus,Valid,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,0
3,Acapulco,Valid,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,0
5,Adhi Kot,Valid,4239.0,Fell,1919.0,32.1,71.8,"(32.100000, 71.800000)",1,0
7,Agen,Valid,30000.0,Fell,1814.0,44.2,0.6,"(44.216670, 0.616670)",1,0
8,Aguada,Valid,1620.0,Fell,1930.0,-31.6,-65.2,"(-31.600000, -65.233330)",1,0
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,Valid,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",0,1
45712,Zinder,Valid,46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",0,1
45713,Zlin,Valid,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",0,1
45714,Zubkovsky,Valid,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",0,1
45715,Zulu Queen,Valid,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",0,1

In [42]:
df_copia = df_meteorites.copy(deep=True) # Creando una copia de los datos pero con deep se debe indicar que es profunda con True ya que sino es asi solo guarda los datos simples y no todo

In [43]:
df_copia

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.8,6.1,"(50.775000, 6.083330)",1,0
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,0
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.2,-113.0,"(54.216670, -113.000000)",1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.2,-65.0,"(-33.166670, -64.950000)",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",0,1
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",0,1
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",0,1

In [47]:
df_copia.drop(['id'], axis= 1,inplace=True) # Eliminando de la copia datos

KeyError: "['id'] not found in axis"

In [49]:
df_copia

,name,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,Valid,L5,21.0,Fell,1880.0,50.8,6.1,"(50.775000, 6.083330)",1,0
1,Aarhus,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,0
2,Abee,Valid,EH4,107000.0,Fell,1952.0,54.2,-113.0,"(54.216670, -113.000000)",1,0
3,Acapulco,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,0
4,Achiras,Valid,L6,780.0,Fell,1902.0,-33.2,-65.0,"(-33.166670, -64.950000)",1,0
...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,Valid,Eucrite,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",0,1
45712,Zinder,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",0,1
45713,Zlin,Valid,H4,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",0,1
45714,Zubkovsky,Valid,L6,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",0,1
45715,Zulu Queen,Valid,L3.7,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",0,1

In [48]:
df_meteorites

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.8,6.1,"(50.775000, 6.083330)",1,0
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.2,10.2,"(56.183330, 10.233330)",1,0
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.2,-113.0,"(54.216670, -113.000000)",1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.9,-99.9,"(16.883330, -99.900000)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.2,-65.0,"(-33.166670, -64.950000)",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.0,17.0,"(29.037000, 17.018500)",0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.8,9.0,"(13.783330, 8.966670)",0,1
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.2,17.7,"(49.250000, 17.666670)",0,1
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.8,41.5,"(49.789170, 41.504600)",0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,34.0,-115.7,"(33.983330, -115.683330)",0,1